/*****************************************************/
/*   スプライン関数の決定 (1次係数法)    spline.c    */
/*****************************************************/

#include <stdio.h>
#include <math.h>
#define N 10

int main(void) {
    int i, j, k, n;
    double A[N], B[N], C[N + 2], D[N], h[N], x[N];
    double y[N], u[N], p[N + 2][N + 3]; 
    double g, q;

    /* h[]:hj  u[]:uj  A[],B[],C[],D[]:Aj,Bj,Cj,Dj */  
    /* p[][]:連立方程式の係数配列  */
    /* x, y に関するデータの入力  */
    
    n = 4;
    x[0] = 0.0; y[0] = 2.0;
    x[1] = 1.0; y[1] = 4.0;
    x[2] = 1.5; y[2] = 3.0;
    x[3] = 2.0; y[3] = 1.0;
    x[4] = 3.0; y[4] = 2.0;

    C[1] = 5.0;
    C[n + 1] = 3.0;
    
    /* 与えられた分点からすぐに求まるDとhとuを計算 */  
    for (i = 1; i <= n; i++) {
        D[i]  = y[i - 1]; // D_iにy_(i-1)を代入
        h[i]  = x[i] - x[i - 1]; // 分点間の間隔を計算
        u[i]  = (y[i] - y[i - 1]) / h[i]; // uの計算
    }
    
    /* 配列pの初期化 */
    for (i = 1; i <= n + 1; i++) {
        for (j = 1; j <= n + 2; j++) {
            p[i][j] = 0.0;
        }
    }

    /*  漸化式から得られる連立方程式の係数を */
    /*  配列 p に入れる．*/
    p[1][1] = 1.0;
    p[n + 1][n + 1] = 1.0;
    p[1][n + 2] = C[1];
    p[n + 1][n + 2] = C[n + 1];
    
    for (j = 2; j <= n; j++) {
        p[j][j - 1] = h[j];
        p[j][j] = 2 * (h[j - 1] + h[j]);
        p[j][j + 1] = h[j - 1];
        p[j][n + 2] = 3 * (h[j] * u[j - 1] + h[j - 1] * u[j]);
    }

    /*  ガウス・ジョルダン（掃き出し）法により */
    /*  連立方程式を解く */
    for (k = 1; k <= n + 1; k++) {
        for (j = k + 1; j <= n + 2; j++) {
            p[k][j] /= p[k][k];
        }
        
        p[k][k] = 1.0;
        
        for (i = 1; i <= n + 1; i++) {
            if (i == k) {
                continue;
            }
            for (j = k + 1; j <= n + 2; j++) {
                p[i][j] -= p[i][k] * p[k][j];
            }
            p[i][k] = 0.0;
        }
    }
    
    /*  上で得られた解を配列 C に入れる．*/
    for (j = 1; j <= n; j++) {
        C[j] = p[j][n + 2];
    }
    
    /*  B1,B2,・・・,Bnを求める．*/
    for (j = 1; j <= n - 1; j++) {
        B[j] = (3 * u[j] - 2 * C[j] - C[j + 1]) / h[j];
    }
    B[n] = -(3 * u[n - 1] - C[n - 1] - 2 * C[n]) / h[n - 1];
    
    /*  A1,A2,・・・,Anを求める．*/
    for (j = 1; j <= n - 1; j++) {
        A[j] = (u[j] - h[j] * B[j] - C[j]) / (h[j] * h[j]);
    }
    A[n] = (u[n] - h[n] * B[n] - C[n]) / (h[n] * h[n]);
    
    /*  結果を出力する  */
    printf("各区間のスプライン関数の係数を出力します\n");
    printf("(X-Xj)の降べきの順（係数Aj,Bj,Cj,Djの値）\n");
    for(i = 1; i <= n; i++) {
        printf("S%d(x)=", i);
        printf("(%6.3lf)(x-%6.3lf)^3+", A[i], x[i - 1]);
        printf("(%6.3lf)(x-%6.3lf)^2+", B[i], x[i - 1]);
        printf("(%6.3lf)(x-%6.3lf)+", C[i], x[i - 1]);
        printf("(%6.3lf)\n", D[i]);
    }

    return 0;
}

